<html><!--
 Page saved with SingleFile 
 url: http://www.openrce.org/articles/full_view/23 
 saved date: Tue Jul 07 2020 15:28:23 GMT+0800 (China Standard Time)
--><meta charset=utf-8>
<meta name=description content="OpenRCE: The Open Reverse Code Engineering Community">
<meta name=keywords content="OpenRCE, Reverse Engineering, Reverse Code Engineering, IDA Pro, IDA Pro Scripts, IDA Pro Plugins, OllyDbg, OllyDbg Plugins, WinDbg, SoftIce">
<title>OpenRCE</title>

 <td width=33% align=right><img src="data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABAAAAAQCAYAAAAf8/9hAAAAKnRFWHRDcmVhdGlvbiBUaW1lAERpIDYgSnVsIDIwMDQgMTM6NTQ6MjIgKzAxMDA2ZMseAAAAB3RJTUUH1AcHCB4SQ2cPHwAAAAlwSFlzAAALEQAACxEBf2RfkQAAAARnQU1BAACxjwv8YQUAAAKcSURBVHjaXVNNbxJRFL1vOlMYQqG0hVowUdOaNEI/FiZq0pCYuNGmmtiFcePChT+Bn4C/wDSuTLp107iRSOOC1ISFDSVo1LYxGGgV2jAUgZbhY3ruE5D0JYdHZu4579wz9wn6vwT/RCKRcV3Xp1qtlqvdbluHh4e/1tfXC3jVBiy6sNRYLLaSy+WeDQ8P+x0Oh9/tdk9i1zVNpbPTM9rd3a1B5MHm5mYK9dWLIiIej5vhcFhrNptULpepXq/Tp60t+pzKkGLXrdnQnKgbRwWj+DtpGOXXa2trCfBOgY500LMuhKBAIEC1Wo08Hg/de/qCPNOzYsxO5NVpUm+3Hu0ktx76/f6djY2N59vb2z9AO1MVRSHYl6hWq+R0Oim0EKT35hu674mSTftntaMIuhEMCt3hWETdWwg8weNvKoKSBZZlSTKLTF+7Tt6Ps/Th+zu6dec2lUolymazVrFYJMMw+LAroISBohRA4lJgaGhIOul0OtTIUefmUlBkMhmRTqc5G2Gz2QgByzqsAKCrTGYCC/Guqqp0VCgWFA42lUoR75yLpmnygOPj435+SqPRoJOTk74AF3MumAV5mt1ut0ZGRqRwT2BgboQKQhOFaqVSkU9dLlffCQ8SP2MSk1mcW8WBojsPloIeX2J9zefzFpNZiENjAZ4JdmOapiSPjo5KcQj86U2mGo1GX+FPan9///HMzMzd1dXVq6FQSBI5NM5oYmJCtomhO8DnSyJUtpvngRLdMFzAJWBheXl5ZX5+fgmkyxiuv8jIBfG9RCKRxG6ihQPU8RDtAD/FwFjzyLiBKdhf9Hq9c2jF7vP5CHeF++UL9QXYA44AdmEOCvSS1bqOxoExoNV9VwL4+9UGb+ZFgUEhpSvWu33N3gUaXOfQjkaDQ/NcggAAAABJRU5ErkJggg==" border=0> <a href=http://www.openrce.org/articles/print_view/23>Printer Friendly ...</a></td>
 </tr>
</table>
<br>
<div class=table_sub_header> Abstract</div>
<br>
Microsoft Visual C++ is the most widely used compiler for Win32 so it is important for the Win32 reverser to be familiar with its inner working. Being able to recognize the compiler-generated glue code helps to quickly concentrate on the actual code written by the programmer. It also helps in recovering the high-level structure of the program.
<br><br>
In part II of this 2-part article (see also: <a href=http://www.openrce.org/articles/full_view/21>Part I: Exception Handling</a>), I will cover how C++ machinery is implemented in MSVC, including classes layout, virtual functions, RTTI. Familiarity with basic C++ and assembly language is assumed.
<br><br>
<div class=table_sub_header> Basic Class Layout</div>
<br>
To illustrate the following material, let's consider this simple example:
<br><br>
<pre>    class A
    {
      int a1;
    public:
      virtual int A_virt1();
      virtual int A_virt2();
      static void A_static1();
      void A_simple1();
    };

    class B
    {
      int b1;
      int b2;
    public:
      virtual int B_virt1();
      virtual int B_virt2();
    };

    class C: public A, public B
    {
      int c1;
    public:
      virtual int A_virt2();
      virtual int B_virt2();
    };
</pre>
<br>
In most cases MSVC lays out classes in the following order:
<ul>
<li> 1. Pointer to virtual functions table (_vtable_ or _vftable_), added only when the class has virtual methods and no suitable table from a base class can be reused.
<li> 2. Base classes
<li> 3. Class members
</ul>
Virtual function tables consist of addresses of virtual methods in the order of their first appearance. Addresses of overloaded functions replace addresses of functions from base classes.
<br><br>
Thus, the layouts for our three classes will look like following:
<br><br>
<pre>    class A size(8):
        +---
     0  | {vfptr}
     4  | a1
        +---

    A's vftable:
     0  | &amp;A::A_virt1
     4  | &amp;A::A_virt2

    class B size(12):
        +---
     0  | {vfptr}
     4  | b1
     8  | b2
        +---

    B's vftable:
     0  | &amp;B::B_virt1
     4  | &amp;B::B_virt2

    class C size(24):
        +---
        | +--- (base class A)
     0  | | {vfptr}
     4  | | a1
        | +---
        | +--- (base class B)
     8  | | {vfptr}
    12  | | b1
    16  | | b2
        | +---
    20  | c1
        +---

    C's vftable for A:
     0  | &amp;A::A_virt1
     4  | &amp;C::A_virt2

    C's vftable for B:
     0  | &amp;B::B_virt1
     4  | &amp;C::B_virt2
</pre>
<br>
The above diagram was produced by the VC8 compiler using an undocumented switch. To see the class layouts produced by the compiler, use: -d1reportSingleClassLayout<name> to see the layout of a single class -d1reportAllClassLayout to see the layouts of all classes (including internal CRT classes) The layouts are dumped to stdout.
<br><br>
As you can see, C has two vftables, since it has inherited two classes which both already had virtual functions. Address of C::A_virt2 replaces address of A::A_virt2 in C's vftable for A, and C::B_virt2 replaces B::B_virt2 in the other table.
<br><br>
